USE [Project_Sbyt]
GO

-------------------------------------
--Предзаполним основные справочники--
-------------------------------------

INSERT INTO [sbyt].[Типы_классификатора]
           ([Папки],[Папки_Add],[Название])
     VALUES
           (null,0,'Типы договоров'),
		   (null,0,'Категории'),
		   (null,0,'Отрасль'),
		   (null,0,'Бюджет'),
		   (null,0,'Типы показаний'),
		   (null,0,'Типы документов'),
		   (null,0,'Виды параметров')
GO

--Delete select * from [sbyt].[Классификаторы]

------------------
--Типы договоров--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (1,null,1,null,'Типы договоров','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Типы договоров');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (1,@kl,0,null,'Договор энергоснабжения',''),
		   (1,@kl,0,null,'Договор купли-продажи',''),
		   (1,@kl,0,null,'Договор хозяйственные нужды','')
GO

------------------
--Категории--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (2,null,1,null,'Категории','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Категории');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (2,@kl,0,null,'Население',''),
		   (2,@kl,0,null,'Промышленность',''),
		   (2,@kl,0,null,'Непромышленные и приравненные к ним потребители','')
GO

------------------
--Отрасль--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (3,null,1,null,'Отрасль','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Отрасль');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (3,@kl,0,null,'Ремонт компьютеров',''),
		   (3,@kl,0,null,'Деятельность в области здравоохранения',''),
		   (3,@kl,0,null,'Деятельность в области спорта','')
GO

------------------
--Бюджет--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (4,null,1,null,'Бюджет','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Бюджет');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (4,@kl,0,null,'Федеральный бюджет',''),
		   (4,@kl,0,null,'Областной бюджет',''),
		   (4,@kl,0,null,'Муниципальный бюджет','')
GO

------------------
--Типы показаний--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (5,null,1,null,'Типы показаний','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Типы показаний');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (5,@kl,0,null,'КП',''),
		   (5,@kl,0,null,'АБ',''),
		   (5,@kl,0,null,'ДС','')
GO

------------------
--Типы документов--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (6,null,1,null,'Типы документов','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Типы документов');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (6,@kl,0,null,'Счет-фактура',''),
		   (6,@kl,0,null,'Акт',''),
		   (6,@kl,0,null,'Счет',''),
		   (6,@kl,0,null,'Приходный кассовый ордер','')
GO

------------------
--Виды параметров--
------------------
INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (7,null,1,null,'Виды параметров','Папка')
GO

Declare @kl int = (Select top 1 Row_ID from sbyt.[Классификаторы] Where [Название] = 'Виды параметров');

INSERT INTO [sbyt].[Классификаторы]
           ([Тип],[Папки],[Папки_Add],[Код],[Название],[Примечание])
     VALUES
           (7,@kl,0,null,'Наличие соглашение ЭДО',''),
		   (7,@kl,0,null,'Включать счет на оплату аванса в комплект документов',''),
		   (7,@kl,0,null,'Доставка уведомлений',''),
		   (7,@kl,0,null,'Тип комплекта документов',''),
		   (7,@kl,0,null,'Площадь помещения',''),
		   (7,@kl,0,null,'Категория отключения потребителя','')
GO

--Select * from sbyt.[Классификаторы]

-----------------
---Номенклатура--
-----------------
INSERT INTO [Sbyt].[Номенклатура]
           ([Наименование],[Номинальная_мощность],[Разрядность],[Дробная_разрядность],[Завод_изготовитель])
     VALUES
           ('МИРТЕК-32-РУ-W32',10,6,2,'ООО «Миртек-инжиниринг»'),
		   ('МИРТЕК-12-РУ-W3',10,6,2,'ООО «Миртек-инжиниринг»'),
		   ('Меркурий 201.7',10,5,1,'ООО «Инкотекс-СК»'),
		   ('Меркурий 230 AM',8,5,1,'ООО «Инкотекс-СК»')
GO


--Select * from sbyt.Номенклатура

-----------------
---Организации---
-----------------
INSERT INTO [Sbyt].[Организации]
           ([ИНН],[КПП],[ОГРН],[Название],[Наименование],[Вид_организации],[Юридический_адрес],[Фактический_адрес],[Телефоны],[Емайл],[Примечание])
     VALUES
           ('1234567890','1234567800','1234567890123','Организация №1','Полное название организации №1',1,'Республика Мордовия, город Саранск, улица Ленина, дом 1'
           ,'Республика Мордовия, город Саранск, улица Ленина, дом 1','+78342270000,+78342270099','test123@yandex.ru',''),
		   ('2234567890','2234567800','2234567890123','Организация №2','Полное название организации №2',1,'Республика Мордовия, город Саранск, улица Ленина, дом 47'
           ,'Республика Мордовия, город Саранск, улица Ленина, дом 47','88342271000,88342271099','test222@mail.ru','Добросовестный потребитель'),
		   ('3234567890','3234567800','3234567890123','Организация №3','Полное название организации №3',1,'Республика Мордовия, город Саранск, улица Советская, дом 31'
           ,'Республика Мордовия, город Саранск, улица Советская, дом 31','88342283000','test333@rambler.ru',''),
		   ('123456789012','','','ИП Иванов И.И.','Индивидуальный предприниматель Иванов Иван Иванович',0,'г. Саранск, ул. Крупской, д. 20'
           ,'г. Саранск, ул. Крупской, д. 20','89173992525','ivanov@yandex.ru',''),
		   ('123456789021','','','ИП Сидоров С.П.','Индивидуальный предприниматель Сидоров Сергей Петрович',0,'г. Саранск, ул. Коммунистическая, д. 41'
           ,'г. Саранск, ул. Коммунистическая, д. 41','89173992500','sidorov@yandex.ru','Злостный неплательщик'),
		   ('4234567890','4234567800','','Организация №4','Полное название организации №4',1,'г. Саранск, ул. Советская, д. 101'
           ,'г. Саранск, ул. Советская, д. 101','88342283000','test444@rambler.ru','')
GO

--Select * from sbyt.Организации

-----------------
---Пользователи---
-----------------

INSERT INTO [Sbyt].[Пользователи]
           ([Логин],[Пароль],[Фамилия],[Имя],[Отчество],[Отдел])
     VALUES
		   ( SYSTEM_USER,'admin','Пшиков','Игорь','Евгеньевич','Отдел информационного сопровождения'),
           ('System','qwerty','Система','','',''),
		   ('m.ivanova','','Иванова','Мария','Петровна','Бухгалтерия')
GO

--Select * from sbyt.Пользователи


---------------------------
--Основной бизнес процесс--
---------------------------

--Организация
INSERT INTO [Sbyt].[Организации]
           ([ИНН],[КПП],[ОГРН],[Название],[Наименование],[Вид_организации],[Юридический_адрес],[Фактический_адрес],[Телефоны],[Емайл],[Примечание])
	 OUTPUT inserted.*
     VALUES
           ('1111111111','2222222222','1034567890123','ООО Рога и Копыта','Общество с ограниченной ответственностью "Рога и Копыта"',1,
		   'Республика Мордовия, город Саранск, улица Серова, дом 31','Республика Мордовия, город Саранск, улица Серова, дом 31','8342270001','RogaIKopyta@yandex.ru','Контактное лицо по заключению договора Иванова О.П. тел 477735')
	
GO

--Устанавливаем параметры на организацию, если это необходимо
Declare @orgID int		= (Select top 1 o.Row_ID from Sbyt.Организации o where o.ИНН = '1111111111' and o.КПП = '2222222222')
Declare @prID int		= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 7 and k.Название = 'Наличие соглашение ЭДО')

INSERT INTO [Sbyt].[Свойства]
           ([Виды_Параметры],[Параметры_Счет],[Параметры_Договор],[Параметры_Организация],[ДатНач],[Значение],[Примечание])
     VALUES
           (@prID,null,null,@orgID,GetDate(),1,'СБИС')
GO

--Заводим договор
Declare @orgID int		= (Select top 1 o.Row_ID from Sbyt.Организации o where o.ИНН = '1111111111' and o.КПП = '2222222222')
Declare @tipDogID int	= (Select top 1 kl.Row_ID 
						   from Sbyt.Классификаторы kl 
						   join Sbyt.Типы_классификатора tkl on kl.Тип = tkl.Row_ID
						   Where tkl.Название = 'Типы договоров' and kl.Папки_Add = 0 and kl.Название = 'Договор купли-продажи')
Declare @katID int		= (Select top 1 kl.Row_ID 
						   from Sbyt.Классификаторы kl 
						   join Sbyt.Типы_классификатора tkl on kl.Тип = tkl.Row_ID
						   Where tkl.Название = 'Категории' and kl.Папки_Add = 0 and kl.Название = 'Промышленность')
Declare @otrID int		= (Select top 1 kl.Row_ID 
						   from Sbyt.Классификаторы kl 
						   join Sbyt.Типы_классификатора tkl on kl.Тип = tkl.Row_ID
						   Where tkl.Название = 'Отрасль' and kl.Папки_Add = 0 and kl.Название = 'Деятельность в области спорта')

INSERT INTO [Sbyt].[Договор]
           ([Номер],[Плательщик_ИД],[Грузополучатель_ИД],[Начало_договора],[Тип_договора],[Категория_ИД],[Отрасль_ИД],[Бюджет_ИД],[Примечание])
     VALUES
           ('20210601\1',@orgID,@orgID,'20210101',@tipDogID,@katID,@otrID,null,'Примечание пользователя при занесении договора')
GO

--Занесем параметры на Договор
Declare @dogID int	= (Select top 1 d.Row_ID from Sbyt.Договор d where d.Номер = '20210601\1');
Declare @prID1 int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 7 and k.Название = 'Включать счет на оплату аванса в комплект документов')
Declare @prID2 int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 7 and k.Название = 'Тип комплекта документов')

INSERT INTO [Sbyt].[Свойства]
           ([Виды_Параметры],[Параметры_Счет],[Параметры_Договор],[Параметры_Организация],[ДатНач],[Значение],[Примечание])
     VALUES
           (@prID1,null,@dogID,null,GetDate(),0,'Без авансов'),
		   (@prID2,null,@dogID,null,GetDate(),5,'Комплект документов для нежилых помещений многоквартирных домов')
GO

--Заводим лицевые счета
INSERT INTO [Sbyt].[Лицевые_счета]
           ([Номер],[Адрес],[Примечание])
     VALUES (10000001,'г. Саранск, ул Красная, д 13','подвальное помещение');
		   
INSERT INTO [Sbyt].[Лицевые_счета]
           ([Номер],[Адрес],[Примечание])
     VALUES (10000002,'г. Саранск, ул Зеленая, д 15 пом. 4','');

INSERT INTO [Sbyt].[Лицевые_счета]
           ([Номер],[Адрес],[Примечание])
     VALUES (10000003,'г. Саранск, ул Ленина , д 114 пом. 312','кабинет приемной');

INSERT INTO [Sbyt].[Лицевые_счета]
           ([Номер],[Адрес],[Примечание])
     VALUES (10000004,'г. Саранск, ул Ленина , д 114 пом. 311','');

--Поместим данные лицевые счета в договор с ООО Рога и Копыта
Declare @dogID int	= (Select top 1 d.Row_ID from Sbyt.Договор d where d.Номер = '20210601\1')
Declare @ls1 int	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000001)
Declare @ls2 int	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000002)
Declare @ls3 int	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000003)
Declare @ls4 int	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000004)

INSERT INTO [Sbyt].[Лицевые_договора]
           ([Договор_ИД],[Лицевой_ИД],[ДатНач],[ДатКнц])
	VALUES (@dogID,@ls1,'20210101','20210228'),
		   (@dogID,@ls2,'20210101','20451231'),
		   (@dogID,@ls3,'20210101','20451231'),
		   (@dogID,@ls4,'20210101','20451231')
GO

--Занесем параметры на лицевые счета
Declare @ls1 int	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000002)
Declare @ls2 int	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000003)
Declare @prID1 int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 7 and k.Название = 'Площадь помещения')


INSERT INTO [Sbyt].[Свойства]
           ([Виды_Параметры],[Параметры_Счет],[Параметры_Договор],[Параметры_Организация],[ДатНач],[Значение],[Примечание])
     VALUES
           (@prID1,@ls1,null,null,'20210101',15,'м.кв.'),
		   (@prID1,@ls2,null,null,'20210101',45,'м.кв.')
GO

-------------------------------------------------------------
--Занесем прибор учета на лицевой счет-----------------------
-------------------------------------------------------------

Declare @ls bigint	= (Select top 1 ls.Row_ID from Sbyt.[Лицевые_счета] ls where ls.Номер = 10000003)
Declare @nom int	= (Select top 1 nom.Row_ID from Sbyt.Номенклатура nom where nom.Наименование = 'Меркурий 201.7')

INSERT INTO [Sbyt].[Список_объектов]
           ([ДатНач],[Номенклатура_Объекты],[Заводской_номер],[Номер_пломбы],[Тарифность],[Коэффициент_трансформации],[Год_выпуска],[Объекты_Счет])
	OUTPUT inserted.*
     VALUES
           ('20210101',@nom,'123456789-07','123-987654',1,1,'20200801',@ls)
GO

----------------------------------------------------------
--Занесем показания на прибор учета-----------------------
----------------------------------------------------------

Declare @pu bigint	= (Select top 1 pu.Row_ID from Sbyt.Список_объектов pu 
					  where pu.Заводской_номер = '123456789-07'
					       and (getdate() between pu.ДатНач and pu.ДатКнц) )

Declare @tip int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 5 and k.Название = 'КП')

INSERT INTO [Sbyt].[Показания_счетчиков]
           ([Объект_Показание],[Тип_ввода],[Дата],[Расчетный_месяц],[Показание],[Расход],[Дополнительный_расход],[Итоговый_расход],[Тип])
     VALUES
           (@pu,@tip,
		   dateadd (day, -day (getdate()) + 1, getdate()),
		   dateadd (day, -day (getdate()) + 1, getdate())
           ,1,0,0,0,1), -- Установочные показания
		   (@pu,@tip,
		   getdate(),
		   dateadd (day, -day (getdate()) + 1, getdate())
           ,150,149,10,159,1) -- Текущие показания

GO

-------------------------------------------------------------------
--Выставим комплект документов + произведем оплату от потребителя--
-------------------------------------------------------------------
Declare @sf		int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 6 and k.Название = 'Счет-фактура');
Declare @akt	int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 6 and k.Название = 'Акт');
Declare @schet	int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 6 and k.Название = 'Счет');
Declare @money	int	= (Select top 1 k.Row_ID from sbyt.[Классификаторы] k Where k.Тип = 6 and k.Название = 'Приходный кассовый ордер');

Declare @dogID	int = (Select top 1 d.Row_ID from Sbyt.Договор d where d.Номер = '20210601\1');
Declare @orgID  int	= (Select top 1 o.Row_ID from Sbyt.Организации o where o.ИНН = '1111111111' and o.КПП = '2222222222')

INSERT INTO [Sbyt].[Документ]
           ([Папки],[Папки_Add],[Тип_документа],[Номер],Дата,[Плательщик_ИД],[Грузополучатель_ИД],[Количество],[Сумма],[СуммаСНДС],[Наименование],[Документ_Договор])
     VALUES
           (null,0 --В корень папки
           ,@sf,12345,getdate(), @orgID,@orgID,159,5000,6000
           ,'Счет-Фактура за ' + cast(month(getdate()) as nvarchar(2)) + '.'+ cast(year(getdate()) as nvarchar(4))
		   ,@dogID),
		   (null,0,@akt,12345,getdate(),@orgID,@orgID,159,5000,6000
           ,'Акт за ' + cast(month(getdate()) as nvarchar(2)) + '.'+ cast(year(getdate()) as nvarchar(4))
		   ,@dogID),
		   (null,0,@schet,12345,getdate(),@orgID,@orgID,159,5000,6000
           ,'Счет за ' + cast(month(getdate()) as nvarchar(2)) + '.'+ cast(year(getdate()) as nvarchar(4))
		   ,@dogID),
		   ----Проведем оплату
		   (null,0,@money,222,getdate(),@orgID,@orgID,null,null,6500
           ,'Поступление денег за ' + cast(month(getdate()) as nvarchar(2)) + '.'+ cast(year(getdate()) as nvarchar(4))
		   ,@dogID)
GO





